docs/design-notes/type-system.org
#+title: type system

* [todo-list]

*** sequent1 and sequent0 in jojo

    - can I re-design sequent0
      by firstly design a small core ?

      or can I design an over-simplified version first ?

    - local var can be non-determined

    - trunk as value which can be unified

      1. there are non-determined var

      2. when applying a function to non-determined var
         it can not really return determined value
         this is where we need to form a trunk

      3. if we can not determine a non-determined trunk now
         after some binding
         we might be able to determine it
         thus every time we see a trunk
         we try to determine it

      4. two non-determined trunk might be unified with each other
         if the function body to be applied are
         [structurally] the same
         and their arguments can be unified

      5. equivalence between function body
         is not limited to 'structurally the same'

         'add-commutative' is just saying (= {add} {swap add})
         'add-associative' is just saying (= {add :z add} {:z add add})

         we just need to supply the arguments of the function
         to get back (+proof add-commutative)
         and (+proof add-commutative)

    - when type-apply

      - function cut
        - such as 'recur' and 'eq-apply'
        the information needed to apply the function body
        is not there
        so we use its type
        to do a cut

      - data and variable
        - such as ':m.pre' and '{succ}'
        do not cut
        they already contain more information
        than their type

    - can cut not happen in trunk ?
      - check the examples we have now

*** self-interpreting

    - forgetful functor -- code generation

    - equivalence -- quotype

    - unification -- uses 'equal?'

    - module -- name space

*** recall the old <red-black-tree> proof

*** use number theory -- to test type-checker as prover

*** use category theory to test type-class

    - group theory

* [note]

*** many languages

    1. type-name as data-constructor-name
       - can not use forgetful functor
       - can not overload data-constructor-name
       - simple sumtype and product-type

    2. type-name different from data-constructor-name
       - can use forgetful functor

*** (:)

    - (:) collects its body
      and treat the last value of the body
      as the type to be unified

*** function name overload

    - a function name dispatches over its input type
    - a constructor name dispatches over its output type

* number

*** <bool>

    #+begin_src jojo
    (+simple-type <bool>
      true
      false)

    (+type <bool> (-> -- <<type>>)
      true  (-> -- <bool>)
      false (-> -- <bool>))
    #+end_src

