docs/design-notes/type-system.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-12 Thu 18:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>type system</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="xieyuheng" />
<link rel="stylesheet" href="../css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">type system</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1a66017"><span class="todo _todo_list_">[todo-list]</span> </a>
<ul>
<li><a href="#org4948f28">implementation</a></li>
<li><a href="#orge5b48b0">recall the old &lt;red-black-tree&gt; proof</a></li>
<li><a href="#org8eac57">use number theory &#x2013; to test type-checker as prover</a></li>
<li><a href="#orgf294d20">use category theory to test type-class</a></li>
</ul>
</li>
<li><a href="#org6484333"><span class="todo _note_">[note]</span> </a>
<ul>
<li><a href="#orge338f22">core</a></li>
<li><a href="#orga27bf35">trunk</a></li>
<li><a href="#org5d19acf">cut</a></li>
<li><a href="#org635d571">syntax</a>
<ul>
<li><a href="#org50a2c8b">(:)</a></li>
</ul>
</li>
<li><a href="#orgc119a38">we need many languages</a></li>
</ul>
</li>
<li><a href="#orge35f559">number</a>
<ul>
<li><a href="#orge7bb1f5">&lt;bool&gt;</a></li>
<li><a href="#orgfdf34a3">&lt;nat&gt;</a></li>
<li><a href="#org530bb96">&lt;even&gt;</a></li>
<li><a href="#org9dff5d1">&lt;eq&gt; &#x2013; an interface to the internal unification</a></li>
<li><a href="#orged99b90">add-associative &#x2013; structural induction proof</a></li>
<li><a href="#orgec3788">add-commutative</a></li>
<li><a href="#org1d1bf0d"><span class="todo _note_">[note]</span> type-check detail of 'add-zero-commutative'</a></li>
<li><a href="#orgfd487dc"><span class="todo _note_">[note]</span> type-check detail of 'add-commutative'</a></li>
</ul>
</li>
<li><a href="#orgda1f00a">&lt;list&gt;</a>
<ul>
<li><a href="#orgc3cb253">&lt;list&gt;</a></li>
<li><a href="#org9a30bd2">length</a></li>
<li><a href="#org5f10926">map</a></li>
<li><a href="#org3b12fa1">ref</a></li>
<li><a href="#orga7d323b">remove-first</a></li>
</ul>
</li>
<li><a href="#orgec9c72b">&lt;has-length&gt;</a>
<ul>
<li><a href="#org27acd45">&lt;has-length&gt;</a></li>
<li><a href="#org1d37588"><span class="todo _note_">[note]</span> type-check detail of 'map-has-length'</a></li>
</ul>
</li>
<li><a href="#orgb306304">&lt;sexp&gt; &#x2013; symbol expression</a>
<ul>
<li><a href="#orgc663cc0">&lt;sexp&gt;</a></li>
<li><a href="#org922da6b">subst</a></li>
</ul>
</li>
<li><a href="#org5ec846">&lt;lexp&gt; &#x2013; lambda expression</a>
<ul>
<li><a href="#org9457fc4">&lt;lexp&gt;</a></li>
<li><a href="#orgc223559">occurs-free?</a></li>
</ul>
</li>
<li><a href="#org914016c">&lt;vector&gt;</a>
<ul>
<li><a href="#org54e7379">&lt;vector&gt;</a></li>
<li><a href="#org987d8a6">append</a></li>
<li><a href="#org9168f4a">map</a></li>
<li><a href="#orgccaf9b5"><span class="todo _note_">[note]</span> type-check detail of 'append'</a></li>
<li><a href="#orgb74e388"><span class="todo _note_">[note]</span> type-check detail of 'map'</a></li>
<li><a href="#org80dc897">&lt;list&gt; as forgetful functor &#x2013; to reuse &lt;vector&gt;</a></li>
</ul>
</li>
<li><a href="#org720dba3">&lt;binary-tree&gt;</a>
<ul>
<li><a href="#org36a2069">&lt;binary-tree&gt;</a></li>
</ul>
</li>
<li><a href="#org43fcb5">&lt;binary-search-tree&gt;</a>
<ul>
<li><a href="#org21f1a3e">&lt;binary-search-tree&gt;</a></li>
<li><a href="#orgf92fdaa">search</a></li>
<li><a href="#org4451965">insert</a></li>
<li><a href="#org52fb483">delete</a></li>
</ul>
</li>
<li><a href="#org2fed7be"><span class="todo _gt__lt_">&gt;&lt;</span> &lt;red-black-tree&gt;</a>
<ul>
<li><a href="#org722aa0e"><span class="todo _note_">[note]</span> </a></li>
<li><a href="#org6832a36">&lt;red-black-tree&gt; &#x2013; extrinsic</a></li>
<li><a href="#org999306a">&lt;red-black-tree&gt; &#x2013; intrinsic</a></li>
</ul>
</li>
<li><a href="#orgff307da">type-class as subtype of </a>
<ul>
<li><a href="#org4b45594"></a></li>
<li><a href="#org1475610"></a></li>
<li><a href="#orgb1b99d2">&lt;maybe&gt;</a></li>
<li><a href="#orge68e0c0">&lt;state&gt;</a></li>
</ul>
</li>
<li><a href="#org11243ec">quotype &#x2013; quotient type</a>
<ul>
<li><a href="#org3b0822b"><span class="todo _note_">[note]</span> </a></li>
<li><a href="#org4bde230">&lt;int&gt;</a></li>
<li><a href="#org214446a">equal?</a></li>
<li><a href="#orgeadc8df">&lt;fraction&gt;</a></li>
<li><a href="#orgceab14c">equal?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<ul class="org-ul">
<li><p>follow EOPL</p></li></ul>

<div id="outline-container-org1a66017" class="outline-2">
<h2 id="org1a66017"><span class="todo _todo_list_">[todo-list]</span> </h2>
<div class="outline-text-2" id="text-org1a66017">
</div><div id="outline-container-org4948f28" class="outline-3">
<h3 id="org4948f28">implementation</h3>
<div class="outline-text-3" id="text-org4948f28">
<ol class="org-ol">
<li>simple
<ul class="org-ul">
<li><p>unification</p><p>uses 'equal?'</p></li></ul></li>

<li>type-class
<ul class="org-ul">
<li><p>forgetful functor</p><p>code generation</p></li></ul></li>

<li>quotype
<ul class="org-ul">
<li><p>quotype</p><p>the concept of equivalence</p></li></ul></li>

<li>module
<ul class="org-ul">
<li><p>name space</p></li></ul></li></ol>
</div>
</div>

<div id="outline-container-orge5b48b0" class="outline-3">
<h3 id="orge5b48b0">recall the old &lt;red-black-tree&gt; proof</h3>
</div>

<div id="outline-container-org8eac57" class="outline-3">
<h3 id="org8eac57">use number theory &#x2013; to test type-checker as prover</h3>
</div>

<div id="outline-container-orgf294d20" class="outline-3">
<h3 id="orgf294d20">use category theory to test type-class</h3>
<div class="outline-text-3" id="text-orgf294d20">
<ul class="org-ul">
<li><p>group theory</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-org6484333" class="outline-2">
<h2 id="org6484333"><span class="todo _note_">[note]</span> </h2>
<div class="outline-text-2" id="text-org6484333">
</div><div id="outline-container-orge338f22" class="outline-3">
<h3 id="orge338f22">core</h3>
<div class="outline-text-3" id="text-orge338f22">
<ul class="org-ul">
<li><p><p></p><p>can I re-design sequent0</p><p>by firstly design a small core ?</p><p></p></p><p></p><p><p></p><p>or can I design an over-simplified version first ?</p><p></p></p></li></ul>
</div>
</div>

<div id="outline-container-orga27bf35" class="outline-3">
<h3 id="orga27bf35">trunk</h3>
<div class="outline-text-3" id="text-orga27bf35">
<ul class="org-ul">
<li><p>local var can be non-determined</p></li>

<li><p>trunk as value which can be unified</p><p></p><p><ol class="org-ol"></p><p><li>there are non-determined var</li></p><p></p><p><li>when applying a function to non-determined var</p><p>it can not really return determined value</p><p>this is where we need to form a trunk</li></p><p></p><p><li>if we can not determine a non-determined trunk now</p><p>after some binding</p><p>we might be able to determine it</p><p>thus every time we see a trunk</p><p>we try to determine it</li></p><p></p><p><li>two non-determined trunk might be unified with each other</p><p>if the function body to be applied are</p><p>[structurally] the same</p><p>and their arguments can be unified</li></p><p></p><p><li><p></p><p>equivalence between function body</p><p>is not limited to 'structurally the same'</p><p></p></p><p></p><p><p></p><p>'add-commutative' is just saying (= {add} {swap add})</p><p>'add-associative' is just saying (= {add :z add} {:z add add})</p><p></p></p><p></p><p><p></p><p>we just need to supply the arguments of the function</p><p>to get back (+proof add-commutative)</p><p>and (+proof add-commutative)</p><p></p></li></ol></p></li></ul>
</div>
</div>

<div id="outline-container-org5d19acf" class="outline-3">
<h3 id="org5d19acf">cut</h3>
<div class="outline-text-3" id="text-org5d19acf">
<ul class="org-ul">
<li><p>when type-apply</p><p></p><p><ul class="org-ul"></p><p><li><p><p></p><p>function cut</p><p></p></p><p><ul class="org-ul"></p><p><li><p>such as 'recur' and 'eq-apply'</p></li></ul></p><p><p></p><p>the information needed to apply the function body</p><p>is not there</p><p>so we use its type</p><p>to do a cut</p><p></p></p></li></p><p></p><p><li><p><p></p><p>data and variable</p><p></p></p><p><ul class="org-ul"></p><p><li><p>such as ':m.pre' and '{succ}'</p></li></ul></p><p><p></p><p>do not cut</p><p>they already contain more information</p><p>than their type</p><p></p></p></li></ul></p></li>

<li><p>can cut not happen in trunk ?</p><p><ul class="org-ul"></p><p><li><p>check the examples we have now</p></li></ul></p></li></ul>
</div>
</div>

<div id="outline-container-org635d571" class="outline-3">
<h3 id="org635d571">syntax</h3>
<div class="outline-text-3" id="text-org635d571">
</div><div id="outline-container-org50a2c8b" class="outline-4">
<h4 id="org50a2c8b">(:)</h4>
<div class="outline-text-4" id="text-org50a2c8b">
<ul class="org-ul">
<li><p>(:) collects its body</p><p>and treat the last value of the body</p><p>as the type to be unified</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-orgc119a38" class="outline-3">
<h3 id="orgc119a38">we need many languages</h3>
<div class="outline-text-3" id="text-orgc119a38">
<ol class="org-ol">
<li>type-name as data-constructor-name
<ul class="org-ul">
<li><p>can not use forgetful functor</p></li>
<li><p>can not overload data-constructor-name</p></li>
<li><p>simple sumtype and product-type</p></li></ul></li>

<li>type-name different from data-constructor-name
<ul class="org-ul">
<li><p>can use forgetful functor</p></li></ul></li></ol>
</div>
</div>
</div>

<div id="outline-container-orge35f559" class="outline-2">
<h2 id="orge35f559">number</h2>
<div class="outline-text-2" id="text-orge35f559">
</div><div id="outline-container-orge7bb1f5" class="outline-3">
<h3 id="orge7bb1f5">&lt;bool&gt;</h3>
<div class="outline-text-3" id="text-orge7bb1f5">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+simple-type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;bool&gt;</span>
  <span style="color: #66d9ef; font-weight: bold;">true</span>
  <span style="color: #66d9ef; font-weight: bold;">false</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;bool&gt;</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">)</span>
  <span style="color: #66d9ef; font-weight: bold;">true</span>  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;bool&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #66d9ef; font-weight: bold;">false</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;bool&gt;</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
