docs/design-notes/type-system.org
*** <nat>

    #+begin_src jojo
    (+simple-type <nat>
      zero
      succ (: .pre <nat>))

    (+type <nat> (-> -- <<type>>)
      zero (-> -- <nat>)
      succ (-> (: .pre <nat>) -- <nat>))

    (+fun add (-> (: :m :n <nat>) -- <nat>)
      (match :n
        zero :m
        succ [:m :n.pre recur succ]))

    (+fun mul (-> (: :m :n <nat>) -- <nat>)
      (match :n
        zero :n
        succ [:m :n.pre recur :n add]))

    (+fun factorial (-> (: :n <nat>) -- <nat>)
      (match :n
        zero [:n succ]
        succ [:n.pre recur :n mul]))
    #+end_src

*** <even>

    #+begin_src jojo
    (+type <even> (-> (: .num <nat>) -- <<type>>)
      zero (-> -- zero <even>)
      plus-two (-> (: .pre :m <even>)
                -- :m succ succ <even>))

    (proof (-> -- zero succ succ <even>)
      zero plus-two)
    #+end_src

*** <eq> -- an interface to the internal unification

    #+begin_src jojo
    (+type <eq> (-> (: .lhs .rhs :<t>) -- <<type>>)
      refl (-> -- :z :z <eq>))

    (+proof eq-apply
      (-> :x :y <eq> (: :f (-> :<t1> -- :<t2>))
       -- :x :f apply, :y :f apply, <eq>)
      refl)

    (+proof eq-swap
      (-> :x :y <eq> -- :y :x <eq>)
      refl)

    (+proof eq-compose
      (-> :x :y <eq> :y :z <eq> -- :x :z <eq>)
      refl)
    #+end_src

*** add-associative -- structural induction proof

    #+begin_src jojo
    (+proof add-associative
      (-> (: :x :y :z <nat>)
       -- :x :y add :z add
          :x :y :z add add <eq>)
      (match :z
        zero refl
        succ [:x :y :z.pre recur {succ} eq-apply]))
    #+end_src

