docs/design-notes/type-system.html

<div id="outline-container-orgfdf34a3" class="outline-3">
<h3 id="orgfdf34a3">&lt;nat&gt;</h3>
<div class="outline-text-3" id="text-orgfdf34a3">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+simple-type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span>
  zero
  succ <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.pre</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">)</span>
  zero <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span>
  succ <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.pre</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> add <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:n</span>
    zero <span style="color: #a6e22e;">:m</span>
    succ <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> succ<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> mul <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:n</span>
    zero <span style="color: #a6e22e;">:n</span>
    succ <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #a6e22e;">:n</span> add<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> factorial <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:n</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:n</span>
    zero <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n</span> succ<span style="color: #797979;">]</span>
    succ <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #a6e22e;">:n</span> mul<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org530bb96" class="outline-3">
<h3 id="org530bb96">&lt;even&gt;</h3>
<div class="outline-text-3" id="text-org530bb96">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;even&gt;</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.num</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">)</span>
  zero <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> zero <span style="color: #66d9ef; font-weight: bold;">&lt;even&gt;</span><span style="color: #696969;">)</span>
  plus-two <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.pre</span> <span style="color: #a6e22e;">:m</span> <span style="color: #66d9ef; font-weight: bold;">&lt;even&gt;</span><span style="color: #696969;">)</span>
            <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:m</span> succ succ <span style="color: #66d9ef; font-weight: bold;">&lt;even&gt;</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">proof</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> zero succ succ <span style="color: #66d9ef; font-weight: bold;">&lt;even&gt;</span><span style="color: #696969;">)</span>
  zero plus-two<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9dff5d1" class="outline-3">
<h3 id="org9dff5d1">&lt;eq&gt; &#x2013; an interface to the internal unification</h3>
<div class="outline-text-3" id="text-org9dff5d1">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.lhs</span> <span style="color: #ae81ff;">.rhs</span> <span style="color: #a6e22e;">:&lt;t&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">)</span>
  <span style="color: #66d9ef; font-weight: bold;">refl</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:z</span> <span style="color: #a6e22e;">:z</span> <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+proof</span> eq-apply
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:x</span> <span style="color: #a6e22e;">:y</span> <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:f</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:&lt;t1&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t2&gt;</span><span style="color: #696969;">))</span>
   <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:x</span> <span style="color: #a6e22e;">:f</span> apply<span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:y</span> <span style="color: #a6e22e;">:f</span> apply<span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #66d9ef; font-weight: bold;">refl</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+proof</span> eq-swap
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:x</span> <span style="color: #a6e22e;">:y</span> <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:y</span> <span style="color: #a6e22e;">:x</span> <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #66d9ef; font-weight: bold;">refl</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+proof</span> eq-compose
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:x</span> <span style="color: #a6e22e;">:y</span> <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span> <span style="color: #a6e22e;">:y</span> <span style="color: #a6e22e;">:z</span> <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:x</span> <span style="color: #a6e22e;">:z</span> <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #66d9ef; font-weight: bold;">refl</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orged99b90" class="outline-3">
<h3 id="orged99b90">add-associative &#x2013; structural induction proof</h3>
<div class="outline-text-3" id="text-orged99b90">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+proof</span> add-associative
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:x</span> <span style="color: #a6e22e;">:y</span> <span style="color: #a6e22e;">:z</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span>
   <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:x</span> <span style="color: #a6e22e;">:y</span> add <span style="color: #a6e22e;">:z</span> add
      <span style="color: #a6e22e;">:x</span> <span style="color: #a6e22e;">:y</span> <span style="color: #a6e22e;">:z</span> add add <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:z</span>
    zero <span style="color: #66d9ef; font-weight: bold;">refl</span>
    succ <span style="color: #797979;">[</span><span style="color: #a6e22e;">:x</span> <span style="color: #a6e22e;">:y</span> <span style="color: #a6e22e;">:z</span><span style="color: #ae81ff;">.pre</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #B380A8;">{</span>succ<span style="color: #B380A8;">}</span> eq-apply<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
