docs/design-notes/type-system.org
*** add-commutative

    #+begin_src jojo
    (+proof add-commutative
      (-> (: :m :n <nat>)
       -- :m :n add, :n :m add <eq>)
      (match :n
        zero [:m add-zero-commutative]
        succ [:m :n.pre recur {succ} eq-apply
              :n.pre :m add-succ-commutative eq-compose]))

    (+proof add-zero-commutative
      (-> (: :m <nat>)
       -- :m zero add, zero :m add <eq>)
      (match :m
        zero refl
        succ [:m.pre recur {succ} eq-apply]))

    (+proof add-succ-commutative
      (-> (: :m :n <nat>)
       -- :m succ :n add, :m :n add succ <eq>)
      (match :n
        zero refl
        succ [:m :n.pre recur {succ} eq-apply]))

    (note prefix notation
      (+proof add-succ-commutative
        (-> (: :m :n (<nat>))
            -- (<eq> (add (succ :m) :n) (succ (add :m :n))))
        (match :n
          zero (refl)
          succ (eq-apply (recur :m :n.pre) {succ}))))
    #+end_src

*** [note] type-check detail of 'add-zero-commutative'

    #+begin_src jojo
    (match :m succ)
    (= :m :m.pre succ)

    (type-computed:

     [:m.pre]
     [recur {succ} eq-apply]

     [:m.pre zero add
      zero :m.pre add <eq>]
     [{succ} eq-apply]

     [:m.pre zero add succ
      zero :m.pre add succ <eq>]

     [:m.pre add succ
      zero :m.pre add succ <eq>])

    (type-asserted:

     [:m zero add
      zero :m add <eq>]

     [:m.pre succ zero add
      zero :m.pre succ add <eq>]

     [:m.pre succ add
      zero :m.pre succ add <eq>]

     [:m.pre add succ
      zero :m.pre succ add <eq>]

     [:m.pre add succ
      zero :m.pre add succ <eq>])
    #+end_src

