docs/design-notes/type-system.html

<div id="outline-container-orgec3788" class="outline-3">
<h3 id="orgec3788">add-commutative</h3>
<div class="outline-text-3" id="text-orgec3788">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+proof</span> add-commutative
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span>
   <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> add<span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:n</span> <span style="color: #a6e22e;">:m</span> add <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:n</span>
    zero <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> add-zero-commutative<span style="color: #797979;">]</span>
    succ <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #B380A8;">{</span>succ<span style="color: #B380A8;">}</span> eq-apply
          <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> <span style="color: #a6e22e;">:m</span> add-succ-commutative eq-compose<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+proof</span> add-zero-commutative
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:m</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span>
   <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:m</span> zero add<span style="color: #f92672; font-weight: bold;">,</span> zero <span style="color: #a6e22e;">:m</span> add <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:m</span>
    zero <span style="color: #66d9ef; font-weight: bold;">refl</span>
    succ <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #B380A8;">{</span>succ<span style="color: #B380A8;">}</span> eq-apply<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+proof</span> add-succ-commutative
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span>
   <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:m</span> succ <span style="color: #a6e22e;">:n</span> add<span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> add succ <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:n</span>
    zero <span style="color: #66d9ef; font-weight: bold;">refl</span>
    succ <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #B380A8;">{</span>succ<span style="color: #B380A8;">}</span> eq-apply<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d1bf0d" class="outline-3">
<h3 id="org1d1bf0d"><span class="todo _note_">[note]</span> type-check detail of 'add-zero-commutative'</h3>
<div class="outline-text-3" id="text-org1d1bf0d">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:m</span> succ<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span> succ<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span>type-computed:

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span><span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #B380A8;">{</span>succ<span style="color: #B380A8;">}</span> eq-apply<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span> zero add
  zero <span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span> add <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span><span style="color: #B380A8;">{</span>succ<span style="color: #B380A8;">}</span> eq-apply<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span> zero add succ
  zero <span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span> add succ <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span> add succ
  zero <span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span> add succ <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span>type-asserted:

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> zero add
  zero <span style="color: #a6e22e;">:m</span> add <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span> succ zero add
  zero <span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span> succ add <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span> succ add
  zero <span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span> succ add <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span> add succ
  zero <span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span> succ add <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span> add succ
  zero <span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.pre</span> add succ <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
