docs/design-notes/type-system.org
*** [note] type-check detail of 'add-commutative'

    #+begin_src jojo
    (match :n succ)
    (= :n :n.pre succ)

    (type-computed:

     [:m :n.pre]
     [recur {succ} eq-apply
      :n.pre :m add-succ-commutative eq-swap eq-compose]

     [:m :n.pre add
      :n.pre :m add <eq>]
     [{succ} eq-apply
      :n.pre :m add-succ-commutative eq-swap eq-compose]

     [:m :n.pre add succ
      :n.pre :m add succ <eq>]
     [:n.pre :m add-succ-commutative eq-swap eq-compose]

     [:m :n.pre add succ
      :n.pre :m add succ <eq>
      :n.pre succ :m add
      :n.pre :m add succ <eq>]
     [eq-swap eq-compose]

     [:m :n.pre add succ
      :n.pre :m add succ <eq>
      :n.pre :m add succ
      :n.pre succ :m add <eq>]
     [eq-compose]

     [:m :n.pre add succ
      :n.pre succ :m add <eq>])

    (type-asserted:

     [:m :n add
      :n :m add <eq>]

     [:m :n.pre succ add
      :n.pre succ :m add <eq>]

     [:m :n.pre add succ
      :n.pre succ :m add <eq>])
    #+end_src

* <list>

*** <list>

    - <list> := <null> | (<sexp> . <list>)

    #+begin_src jojo
    (+type <list> (-> (: .<t> <<type>>) -- <<type>>)
      null (-> -- :<t> <list>)
      cons (-> (: .cdr [:<t> <list>])
               (: .car :<t>)
            -- :<t> <list>))
    #+end_src

*** length

    #+begin_src jojo
    (+fun length (-> (: :l [:<t> <list>]) -- <nat>)
      (match :l
        null zero
        cons [:l.cdr recur succ]))
    #+end_src

*** map

    #+begin_src jojo
    (+fun map (-> (: :l :<t1> <list>)
                  (: :f (-> :<t1> -- :<t2>))
               -- :<t2> <list>)
      (match :l
        null null
        cons [:l.cdr :f recur, :l.car :f apply, cons]))
    #+end_src

*** ref

    #+begin_src jojo
    (+fun ref (-> (: :l :<t> <list>) (: :index <nat>) -- :<t>)
      (match :index
        zero [:l.car]
        succ [:l.cdr :index.pre recur]))
    #+end_src

