docs/design-notes/type-system.html

<div id="outline-container-orgfd487dc" class="outline-3">
<h3 id="orgfd487dc"><span class="todo _note_">[note]</span> type-check detail of 'add-commutative'</h3>
<div class="outline-text-3" id="text-orgfd487dc">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:n</span> succ<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:n</span> <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> succ<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span>type-computed:

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span><span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #B380A8;">{</span>succ<span style="color: #B380A8;">}</span> eq-apply
  <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> <span style="color: #a6e22e;">:m</span> add-succ-commutative eq-swap eq-compose<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> add
  <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> <span style="color: #a6e22e;">:m</span> add <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span><span style="color: #B380A8;">{</span>succ<span style="color: #B380A8;">}</span> eq-apply
  <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> <span style="color: #a6e22e;">:m</span> add-succ-commutative eq-swap eq-compose<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> add succ
  <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> <span style="color: #a6e22e;">:m</span> add succ <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> <span style="color: #a6e22e;">:m</span> add-succ-commutative eq-swap eq-compose<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> add succ
  <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> <span style="color: #a6e22e;">:m</span> add succ <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span>
  <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> succ <span style="color: #a6e22e;">:m</span> add
  <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> <span style="color: #a6e22e;">:m</span> add succ <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span>eq-swap eq-compose<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> add succ
  <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> <span style="color: #a6e22e;">:m</span> add succ <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span>
  <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> <span style="color: #a6e22e;">:m</span> add succ
  <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> succ <span style="color: #a6e22e;">:m</span> add <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span>eq-compose<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> add succ
  <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> succ <span style="color: #a6e22e;">:m</span> add <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span>type-asserted:

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> add
  <span style="color: #a6e22e;">:n</span> <span style="color: #a6e22e;">:m</span> add <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> succ add
  <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> succ <span style="color: #a6e22e;">:m</span> add <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> add succ
  <span style="color: #a6e22e;">:n</span><span style="color: #ae81ff;">.pre</span> succ <span style="color: #a6e22e;">:m</span> add <span style="color: #66d9ef; font-weight: bold;">&lt;eq&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgda1f00a" class="outline-2">
<h2 id="orgda1f00a">&lt;list&gt;</h2>
<div class="outline-text-2" id="text-orgda1f00a">
</div><div id="outline-container-orgc3cb253" class="outline-3">
<h3 id="orgc3cb253">&lt;list&gt;</h3>
<div class="outline-text-3" id="text-orgc3cb253">
<ul class="org-ul">
<li><p>&lt;list&gt; := &lt;null&gt; | (&lt;sexp&gt; . &lt;list&gt;)</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.&lt;t&gt;</span> <span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">)</span>
  null <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">)</span>
  cons <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.cdr</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">)</span>
           <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:&lt;t&gt;</span><span style="color: #696969;">)</span>
        <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a30bd2" class="outline-3">
<h3 id="org9a30bd2">length</h3>
<div class="outline-text-3" id="text-org9a30bd2">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> length <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:l</span>
    null zero
    cons <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> succ<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5f10926" class="outline-3">
<h3 id="org5f10926">map</h3>
<div class="outline-text-3" id="text-org5f10926">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> map <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:&lt;t1&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">)</span>
              <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:f</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:&lt;t1&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t2&gt;</span><span style="color: #696969;">))</span>
           <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t2&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:l</span>
    null null
    cons <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #a6e22e;">:f</span> <span style="color: #66d9ef; font-weight: bold;">recur</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:f</span> apply<span style="color: #f92672; font-weight: bold;">,</span> cons<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3b12fa1" class="outline-3">
<h3 id="org3b12fa1">ref</h3>
<div class="outline-text-3" id="text-org3b12fa1">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> ref <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:index</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:index</span>
    zero <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.car</span><span style="color: #797979;">]</span>
    succ <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #a6e22e;">:index</span><span style="color: #ae81ff;">.pre</span> <span style="color: #66d9ef; font-weight: bold;">recur</span><span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
