docs/design-notes/type-system.org
*** remove-first

    #+begin_src jojo
    (+fun remove-first
      (-> (: :x :<t>) (: :l :<t> <list>)
       -- :<t> <list>)
      (match :l
        null null
        cons (match [:l.car :x equal?]
               true  :l.cdr
               false [:l.cdr :x recur :l.car cons])))
    #+end_src

* <has-length>

*** <has-length>

    #+begin_src jojo
    (+type <has-length> (-> (: .list :<t> <list>)
                            (: .length <nat>)
                         -- <<type>>)
      null-has-length (-> -- null zero <has-length>)
      cons-has-length (-> (: .cdr :l :n <has-length>)
                       -- :l :a cons :n succ <has-length>))

    (+fun map-has-length
      (-> (: :has-length :l :n <has-length>)
       -- :l :f map :n <has-length>)
      (match :has-length
        null-has-length null-has-length
        cons-has-length [:has-length.cdr recur cons-has-length]))
    #+end_src

*** [note] type-check detail of 'map-has-length'

    #+begin_src jojo
    (: :has-length :l :n <has-length>)

    (match :has-length cons-has-length)
      (= :has-length :has-length.cdr cons-has-length)
        (: :has-length.cdr [:l#0 :n#0 <has-length>])
      (: :has-length [:l#0 :a#0 cons :n#0 succ <has-length>])
        (= :l :l#0 :a#0 cons)
        (= :n :n#0 succ)

    (type-computed:

     [:has-length.cdr recur cons-has-length]

     [:l#0 :n#0 <has-length>]
     [recur cons-has-length]

     [:l#0 :f#0 map :n#0 <has-length>]
     [cons-has-length]

     [:l#0 :f#0 map :a#1 cons :n#0 succ <has-length>])

    (type-asserted:

     [:l :f map :n <has-length>]

     [:l#0 :a#0 cons :f map :n#0 succ <has-length>]

     [:l#0 :f map :a#0 :f apply cons :n#0 succ <has-length>])
    #+end_src

* <sexp> -- symbol expression

*** <sexp>

    - <sexp> := <symbol> | <list>

    #+begin_src jojo
    (+var <sexp>
      (+ <symbol>, <sexp> <list>))

    (note

      (+fun <exp> (-> (: .<t> <<type>>) -- <<type>>)
        (+ :<t>, :<t> <exp> <list>))

      (+var <sexp>
        (+ <symbol>, <exp>)))
    #+end_src

