docs/design-notes/type-system.html

<div id="outline-container-orga7d323b" class="outline-3">
<h3 id="orga7d323b">remove-first</h3>
<div class="outline-text-3" id="text-orga7d323b">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> remove-first
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:x</span> <span style="color: #a6e22e;">:&lt;t&gt;</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">)</span>
   <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:l</span>
    null null
    cons <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:x</span> equal?<span style="color: #797979;">]</span>
           <span style="color: #66d9ef; font-weight: bold;">true</span>  <span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.cdr</span>
           <span style="color: #66d9ef; font-weight: bold;">false</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #a6e22e;">:x</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.car</span> cons<span style="color: #797979;">]</span><span style="color: #696969;">)))</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgec9c72b" class="outline-2">
<h2 id="orgec9c72b">&lt;has-length&gt;</h2>
<div class="outline-text-2" id="text-orgec9c72b">
</div><div id="outline-container-org27acd45" class="outline-3">
<h3 id="org27acd45">&lt;has-length&gt;</h3>
<div class="outline-text-3" id="text-org27acd45">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;has-length&gt;</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.list</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">)</span>
                        <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.length</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span>
                     <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">)</span>
  null-has-length <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> null zero <span style="color: #66d9ef; font-weight: bold;">&lt;has-length&gt;</span><span style="color: #696969;">)</span>
  cons-has-length <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.cdr</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:n</span> <span style="color: #66d9ef; font-weight: bold;">&lt;has-length&gt;</span><span style="color: #696969;">)</span>
                   <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:a</span> cons <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">&lt;has-length&gt;</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> map-has-length
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:has-length</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:n</span> <span style="color: #66d9ef; font-weight: bold;">&lt;has-length&gt;</span><span style="color: #696969;">)</span>
   <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:f</span> map <span style="color: #a6e22e;">:n</span> <span style="color: #66d9ef; font-weight: bold;">&lt;has-length&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:has-length</span>
    null-has-length null-has-length
    cons-has-length <span style="color: #797979;">[</span><span style="color: #a6e22e;">:has-length</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> cons-has-length<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d37588" class="outline-3">
<h3 id="org1d37588"><span class="todo _note_">[note]</span> type-check detail of 'map-has-length'</h3>
<div class="outline-text-3" id="text-org1d37588">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:has-length</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:n</span> <span style="color: #66d9ef; font-weight: bold;">&lt;has-length&gt;</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:has-length</span> cons-has-length<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:has-length</span> <span style="color: #a6e22e;">:has-length</span><span style="color: #ae81ff;">.cdr</span> cons-has-length<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:has-length</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l#0</span> <span style="color: #a6e22e;">:n#0</span> <span style="color: #66d9ef; font-weight: bold;">&lt;has-length&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:has-length</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l#0</span> <span style="color: #a6e22e;">:a#0</span> cons <span style="color: #a6e22e;">:n#0</span> succ <span style="color: #66d9ef; font-weight: bold;">&lt;has-length&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:l#0</span> <span style="color: #a6e22e;">:a#0</span> cons<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:n</span> <span style="color: #a6e22e;">:n#0</span> succ<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span>type-computed:

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:has-length</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> cons-has-length<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l#0</span> <span style="color: #a6e22e;">:n#0</span> <span style="color: #66d9ef; font-weight: bold;">&lt;has-length&gt;</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span><span style="color: #66d9ef; font-weight: bold;">recur</span> cons-has-length<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l#0</span> <span style="color: #a6e22e;">:f#0</span> map <span style="color: #a6e22e;">:n#0</span> <span style="color: #66d9ef; font-weight: bold;">&lt;has-length&gt;</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span>cons-has-length<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l#0</span> <span style="color: #a6e22e;">:f#0</span> map <span style="color: #a6e22e;">:a#1</span> cons <span style="color: #a6e22e;">:n#0</span> succ <span style="color: #66d9ef; font-weight: bold;">&lt;has-length&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span>type-asserted:

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:f</span> map <span style="color: #a6e22e;">:n</span> <span style="color: #66d9ef; font-weight: bold;">&lt;has-length&gt;</span><span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l#0</span> <span style="color: #a6e22e;">:a#0</span> cons <span style="color: #a6e22e;">:f</span> map <span style="color: #a6e22e;">:n#0</span> succ <span style="color: #66d9ef; font-weight: bold;">&lt;has-length&gt;</span><span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l#0</span> <span style="color: #a6e22e;">:f</span> map <span style="color: #a6e22e;">:a#0</span> <span style="color: #a6e22e;">:f</span> apply cons <span style="color: #a6e22e;">:n#0</span> succ <span style="color: #66d9ef; font-weight: bold;">&lt;has-length&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb306304" class="outline-2">
<h2 id="orgb306304">&lt;sexp&gt; &#x2013; symbol expression</h2>
<div class="outline-text-2" id="text-orgb306304">
</div><div id="outline-container-orgc663cc0" class="outline-3">
<h3 id="orgc663cc0">&lt;sexp&gt;</h3>
<div class="outline-text-3" id="text-orgc663cc0">
<ul class="org-ul">
<li><p>&lt;sexp&gt; := &lt;symbol&gt; | &lt;list&gt;</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+var</span> <span style="color: #66d9ef; font-weight: bold;">&lt;sexp&gt;</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+</span> <span style="color: #66d9ef; font-weight: bold;">&lt;symbol&gt;</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #66d9ef; font-weight: bold;">&lt;sexp&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>

  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> <span style="color: #66d9ef; font-weight: bold;">&lt;exp&gt;</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.&lt;t&gt;</span> <span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+</span> <span style="color: #a6e22e;">:&lt;t&gt;</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;exp&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">))</span>

  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+var</span> <span style="color: #66d9ef; font-weight: bold;">&lt;sexp&gt;</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+</span> <span style="color: #66d9ef; font-weight: bold;">&lt;symbol&gt;</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #66d9ef; font-weight: bold;">&lt;exp&gt;</span><span style="color: #696969;">)))</span>
</pre>
</div>
</div>
</div>
