docs/design-notes/type-system.org
*** subst

    #+begin_src jojo
    (+fun subst (-> (: :new <symbol>)
                    (: :old <symbol>)
                    (: :sexp <sexp>)
                 -- <sexp>)
      (case :sexp
        <symbol> (match [:sexp :old equal?]
                   true  :new
                   false :sexp)
        <list>   [:new :old :sexp subst-list]))

    (+fun subst-list (-> (: :new <symbol>)
                         (: :old <symbol>)
                         (: :list <sexp> <list>)
                      -- <sexp> <list>)
      (match :list
        null null
        cons [:new :old :list.cdr recur
              :new :old :list.car subst
              cons]))
    #+end_src

* <lexp> -- lambda expression

*** <lexp>

    - <lexp> := <var> | (lambda (<var>) <lexp>) | (<lexp> <lexp>)

    #+begin_src jojo
    (+simple-type <lexp>
      var-lexp (: .var <var>)
      lam-lexp (: .var <var>) (: .body <lexp>)
      app-lexp (: .rator .rand <lexp>))

    (+type <lexp> (-> -- <<type>>)
      var-lexp (-> (: .var <var>) -- <lexp>)
      lam-lexp (-> (: .var <var>) (: .body <lexp>) -- <lexp>)
      app-lexp (-> (: .rator .rand <lexp>) -- <lexp>))
    #+end_src

*** occurs-free?

    #+begin_src jojo
    (+fun occurs-free?
      (-> (: :search-var <var>) (: :lexp <lexp>)
       -- <bool>)
      (match :lexp
        var-lexp [:search-var :lexp.var equal?]
        lam-lexp [:search-var :lexp.var equal? not
                  :search-var :lexp.body recur and]
        app-lexp [:search-var :lexp.rator recur
                  :search-var :lexp.rand recur or]))
    #+end_src

* <vector>

*** <vector>

    #+begin_src jojo
    (+type <vector>
      (-> (: .length <nat>)
          (: .<t> <<type>>)
       -- <<type>>)
      null (-> -- zero :<t> <vector>)
      cons (-> (: .cdr :n :<t> <vector>)
               (: .car :<t>)
            -- :n succ :<t> <vector>))
    #+end_src

