docs/design-notes/type-system.html

<div id="outline-container-org922da6b" class="outline-3">
<h3 id="org922da6b">subst</h3>
<div class="outline-text-3" id="text-org922da6b">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> subst <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:new</span> <span style="color: #66d9ef; font-weight: bold;">&lt;symbol&gt;</span><span style="color: #696969;">)</span>
                <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:old</span> <span style="color: #66d9ef; font-weight: bold;">&lt;symbol&gt;</span><span style="color: #696969;">)</span>
                <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:sexp</span> <span style="color: #66d9ef; font-weight: bold;">&lt;sexp&gt;</span><span style="color: #696969;">)</span>
             <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;sexp&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:sexp</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;symbol&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> <span style="color: #a6e22e;">:old</span> equal?<span style="color: #797979;">]</span>
               <span style="color: #66d9ef; font-weight: bold;">true</span>  <span style="color: #a6e22e;">:new</span>
               <span style="color: #66d9ef; font-weight: bold;">false</span> <span style="color: #a6e22e;">:sexp</span><span style="color: #696969;">)</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:new</span> <span style="color: #a6e22e;">:old</span> <span style="color: #a6e22e;">:sexp</span> subst-list<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> subst-list <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:new</span> <span style="color: #66d9ef; font-weight: bold;">&lt;symbol&gt;</span><span style="color: #696969;">)</span>
                     <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:old</span> <span style="color: #66d9ef; font-weight: bold;">&lt;symbol&gt;</span><span style="color: #696969;">)</span>
                     <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:list</span> <span style="color: #66d9ef; font-weight: bold;">&lt;sexp&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">)</span>
                  <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;sexp&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:list</span>
    null null
    cons <span style="color: #797979;">[</span><span style="color: #a6e22e;">:new</span> <span style="color: #a6e22e;">:old</span> <span style="color: #a6e22e;">:list</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #66d9ef; font-weight: bold;">recur</span>
          <span style="color: #a6e22e;">:new</span> <span style="color: #a6e22e;">:old</span> <span style="color: #a6e22e;">:list</span><span style="color: #ae81ff;">.car</span> subst
          cons<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5ec846" class="outline-2">
<h2 id="org5ec846">&lt;lexp&gt; &#x2013; lambda expression</h2>
<div class="outline-text-2" id="text-org5ec846">
</div><div id="outline-container-org9457fc4" class="outline-3">
<h3 id="org9457fc4">&lt;lexp&gt;</h3>
<div class="outline-text-3" id="text-org9457fc4">
<ul class="org-ul">
<li><p>&lt;lexp&gt; := &lt;var&gt; | (lambda (&lt;var&gt;) &lt;lexp&gt;) | (&lt;lexp&gt; &lt;lexp&gt;)</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+simple-type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;lexp&gt;</span>
  var-lexp <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.var</span> <span style="color: #66d9ef; font-weight: bold;">&lt;var&gt;</span><span style="color: #696969;">)</span>
  lam-lexp <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.var</span> <span style="color: #66d9ef; font-weight: bold;">&lt;var&gt;</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.body</span> <span style="color: #66d9ef; font-weight: bold;">&lt;lexp&gt;</span><span style="color: #696969;">)</span>
  app-lexp <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.rator</span> <span style="color: #ae81ff;">.rand</span> <span style="color: #66d9ef; font-weight: bold;">&lt;lexp&gt;</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;lexp&gt;</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">)</span>
  var-lexp <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.var</span> <span style="color: #66d9ef; font-weight: bold;">&lt;var&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;lexp&gt;</span><span style="color: #696969;">)</span>
  lam-lexp <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.var</span> <span style="color: #66d9ef; font-weight: bold;">&lt;var&gt;</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.body</span> <span style="color: #66d9ef; font-weight: bold;">&lt;lexp&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;lexp&gt;</span><span style="color: #696969;">)</span>
  app-lexp <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.rator</span> <span style="color: #ae81ff;">.rand</span> <span style="color: #66d9ef; font-weight: bold;">&lt;lexp&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;lexp&gt;</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc223559" class="outline-3">
<h3 id="orgc223559">occurs-free?</h3>
<div class="outline-text-3" id="text-orgc223559">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> occurs-free?
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:search-var</span> <span style="color: #66d9ef; font-weight: bold;">&lt;var&gt;</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:lexp</span> <span style="color: #66d9ef; font-weight: bold;">&lt;lexp&gt;</span><span style="color: #696969;">)</span>
   <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;bool&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:lexp</span>
    var-lexp <span style="color: #797979;">[</span><span style="color: #a6e22e;">:search-var</span> <span style="color: #a6e22e;">:lexp</span><span style="color: #ae81ff;">.var</span> equal?<span style="color: #797979;">]</span>
    lam-lexp <span style="color: #797979;">[</span><span style="color: #a6e22e;">:search-var</span> <span style="color: #a6e22e;">:lexp</span><span style="color: #ae81ff;">.var</span> equal? not
              <span style="color: #a6e22e;">:search-var</span> <span style="color: #a6e22e;">:lexp</span><span style="color: #ae81ff;">.body</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> and<span style="color: #797979;">]</span>
    app-lexp <span style="color: #797979;">[</span><span style="color: #a6e22e;">:search-var</span> <span style="color: #a6e22e;">:lexp</span><span style="color: #ae81ff;">.rator</span> <span style="color: #66d9ef; font-weight: bold;">recur</span>
              <span style="color: #a6e22e;">:search-var</span> <span style="color: #a6e22e;">:lexp</span><span style="color: #ae81ff;">.rand</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> or<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org914016c" class="outline-2">
<h2 id="org914016c">&lt;vector&gt;</h2>
<div class="outline-text-2" id="text-org914016c">
</div><div id="outline-container-org54e7379" class="outline-3">
<h3 id="org54e7379">&lt;vector&gt;</h3>
<div class="outline-text-3" id="text-org54e7379">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span>
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.length</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.&lt;t&gt;</span> <span style="color: #696969;">)</span>
   <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">)</span>
  null <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> zero <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #696969;">)</span>
  cons <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.cdr</span> <span style="color: #a6e22e;">:n</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #696969;">)</span>
           <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:&lt;t&gt;</span><span style="color: #696969;">)</span>
        <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
