docs/design-notes/type-system.org
*** append

    #+begin_src jojo
    (+fun append (-> (: :l0 :m :<t> <vector>)
                     (: :l1 :n :<t> <vector>)
                  -- :m :n add :<t> <vector>)
      (match :l1
        null :l0
        cons [:l0 :l1.cdr recur :l1.car cons]))
    #+end_src

*** map

    #+begin_src jojo
    (+fun map (-> (: :l :n :<t1> <vector>)
                  (: :f (-> :<t1> -- :<t2>))
               -- :n :<t2> <vector>)
      (match :l
        null null
        cons [:l.cdr :f recur :l.car :f apply cons]))
    #+end_src

*** [note] type-check detail of 'append'

    #+begin_src jojo
    (: :l0 [:m :t <vector>])
    (: :l1 [:n :t <vector>])

    (match :l1 cons)
      (= :l1 :l1.cdr :l1.car cons)
        (: :l1.cdr [:n#0 :t#0 <vector>])
        (: :l1.car :t#0)
      (: :l1 [:n#0 succ :t#0 <vector>])
        (= :n :n#0 succ)
        (= :t :t#0)

    (type-computed:

     [:l0 :l1.cdr recur :l1.car cons]

     [:m :t <vector> :n :t <vector>]
     [recur :l1.car cons]

     [:m :t <vector> :n#0 :t#0 <vector>]
     [recur :l1.car cons]

     [:m :n#0 add :t#0 <vector>]
     [:l1.car cons]

     [:m :n#0 add :t#0 <vector> :t#0]
     [cons]

     [:m :n#0 add succ :t#0 <vector>])

    (type-asserted:

     [:m :n add :t <vector>]

     [:m :n#0 succ add :t#0 <vector>]

     [:m :n#0 add succ :t#0 <vector>])
    #+end_src

