docs/design-notes/type-system.html

<div id="outline-container-org987d8a6" class="outline-3">
<h3 id="org987d8a6">append</h3>
<div class="outline-text-3" id="text-org987d8a6">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> append <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l0</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #696969;">)</span>
                 <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l1</span> <span style="color: #a6e22e;">:n</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #696969;">)</span>
              <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> add <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:l1</span>
    null <span style="color: #a6e22e;">:l0</span>
    cons <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l0</span> <span style="color: #a6e22e;">:l1</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #a6e22e;">:l1</span><span style="color: #ae81ff;">.car</span> cons<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9168f4a" class="outline-3">
<h3 id="org9168f4a">map</h3>
<div class="outline-text-3" id="text-org9168f4a">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> map <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:n</span> <span style="color: #a6e22e;">:&lt;t1&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #696969;">)</span>
              <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:f</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:&lt;t1&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t2&gt;</span><span style="color: #696969;">))</span>
           <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:n</span> <span style="color: #a6e22e;">:&lt;t2&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:l</span>
    null null
    cons <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #a6e22e;">:f</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:f</span> apply cons<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgccaf9b5" class="outline-3">
<h3 id="orgccaf9b5"><span class="todo _note_">[note]</span> type-check detail of 'append'</h3>
<div class="outline-text-3" id="text-orgccaf9b5">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l0</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l1</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n</span> <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:l1</span> cons<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:l1</span> <span style="color: #a6e22e;">:l1</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #a6e22e;">:l1</span><span style="color: #ae81ff;">.car</span> cons<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l1</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n#0</span> <span style="color: #a6e22e;">:t#0</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l1</span><span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:t#0</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l1</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n#0</span> succ <span style="color: #a6e22e;">:t#0</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:n</span> <span style="color: #a6e22e;">:n#0</span> succ<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:t</span> :t#0<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span>type-computed:

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l0</span> <span style="color: #a6e22e;">:l1</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #a6e22e;">:l1</span><span style="color: #ae81ff;">.car</span> cons<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span> <span style="color: #a6e22e;">:n</span> <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span><span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #a6e22e;">:l1</span><span style="color: #ae81ff;">.car</span> cons<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span> <span style="color: #a6e22e;">:n#0</span> <span style="color: #a6e22e;">:t#0</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span><span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #a6e22e;">:l1</span><span style="color: #ae81ff;">.car</span> cons<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n#0</span> add <span style="color: #a6e22e;">:t#0</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l1</span><span style="color: #ae81ff;">.car</span> cons<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n#0</span> add <span style="color: #a6e22e;">:t#0</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span> <span style="color: #a6e22e;">:t#0</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span>cons<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n#0</span> add succ <span style="color: #a6e22e;">:t#0</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span>type-asserted:

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> add <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n#0</span> succ add <span style="color: #a6e22e;">:t#0</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n#0</span> add succ <span style="color: #a6e22e;">:t#0</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
