docs/design-notes/type-system.org
*** [note] type-check detail of 'map'

    #+begin_src jojo
    (: :l [:n :t1 <vector>])
    (: :f (-> :t1 :t2))

    (match :l cons)
      (= :l :l.car :l.cdr cons)
        (: :l.cdr [:n#0 :t#0 <vector>])
        (: :l.car :t#0)
      (: :l [:n#0 succ :t#0 <vector>])
        (= :n :n#0 succ)
        (= :t1 :t#0)

    (type-computed:

     [:l.cdr :f recur :l.car :f apply cons]

     [:n#0 :t#0 <vector> (-> :t1 :t2)]
     [recur :l.car :f apply cons]

     [:n#0 :t2 <vector>]
     [:l.car :f apply cons]

     [:n#0 :t2 <vector> :t#0]
     [:f apply cons]

     [:n#0 :t2 <vector> :t2]
     [cons]

     [:n#0 succ :t2 <vector>])

    (type-asserted:

     [:n :t2 <vector>]

     [:n#0 succ :t2 <vector>])

    #+end_src

*** <list> as forgetful functor -- to reuse <vector>

    - forgetful functor of type [not type-class]

    #+begin_src jojo
    (+var <list> (forget .length <vector>))

    (note
      (+fun append (-> (: :l0 :<t> <list>)
                       (: :l1 :<t> <list>)
                    -- :<t> <list>)
        (match :l1
          null :l0
          cons [:l0 :l1.cdr recur :l1.car cons])))
    #+end_src

* <binary-tree>

*** <binary-tree>

    - <binary-tree> := () | (<int> <binary-tree> <binary-tree>)

    #+begin_src jojo
    (+simple-type <binary-tree>
      null
      node (: .value <int>) (: .left .right <binary-tree>))

    (+type <binary-tree> (-> -- <<type>>)
      null (-> -- <binary-tree>)
      node (-> (: .value <int>)
               (: .left .right <binary-tree>)
            -- <binary-tree>))
    #+end_src

* <binary-search-tree>

*** <binary-search-tree>

    - <binary-search-tree> := () | (<int> <binary-search-tree> <binary-search-tree>)

    - not all semantic are expressed in the above grammar.
      1. key in the left subtree <= key in the current node
      2. keys in the right subtree > key in the current node

    #+begin_src jojo
    (+simple-type <order>
      lt eq gt)

    (+simple-type <binary-search-tree>
      null
      node (: .key <symbol>) (: .value <int>)
           (: .left .right <binary-search-tree>))
    #+end_src

