docs/design-notes/type-system.html

<div id="outline-container-orgb74e388" class="outline-3">
<h3 id="orgb74e388"><span class="todo _note_">[note]</span> type-check detail of 'map'</h3>
<div class="outline-text-3" id="text-orgb74e388">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n</span> <span style="color: #a6e22e;">:t1</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:f</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:t1</span> :t2<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:l</span> cons<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.cdr</span> cons<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n#0</span> <span style="color: #a6e22e;">:t#0</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:t#0</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n#0</span> succ <span style="color: #a6e22e;">:t#0</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:n</span> <span style="color: #a6e22e;">:n#0</span> succ<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:t1</span> :t#0<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span>type-computed:

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #a6e22e;">:f</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:f</span> apply cons<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n#0</span> <span style="color: #a6e22e;">:t#0</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:t1</span> <span style="color: #a6e22e;">:t2</span><span style="color: #696969;">)</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span><span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:f</span> apply cons<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n#0</span> <span style="color: #a6e22e;">:t2</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l</span><span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:f</span> apply cons<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n#0</span> <span style="color: #a6e22e;">:t2</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span> <span style="color: #a6e22e;">:t#0</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:f</span> apply cons<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n#0</span> <span style="color: #a6e22e;">:t2</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span> <span style="color: #a6e22e;">:t2</span><span style="color: #797979;">]</span>
 <span style="color: #797979;">[</span>cons<span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n#0</span> succ <span style="color: #a6e22e;">:t2</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span>type-asserted:

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n</span> <span style="color: #a6e22e;">:t2</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span>

 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n#0</span> succ <span style="color: #a6e22e;">:t2</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org80dc897" class="outline-3">
<h3 id="org80dc897">&lt;list&gt; as forgetful functor &#x2013; to reuse &lt;vector&gt;</h3>
<div class="outline-text-3" id="text-org80dc897">
<ul class="org-ul">
<li><p>forgetful functor of type [not type-class]</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+var</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">forget</span> <span style="color: #ae81ff;">.length</span> <span style="color: #66d9ef; font-weight: bold;">&lt;vector&gt;</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> append <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l0</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">)</span>
                   <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:l1</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">)</span>
                <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:l1</span>
      null <span style="color: #a6e22e;">:l0</span>
      cons <span style="color: #797979;">[</span><span style="color: #a6e22e;">:l0</span> <span style="color: #a6e22e;">:l1</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #a6e22e;">:l1</span><span style="color: #ae81ff;">.car</span> cons<span style="color: #797979;">]</span><span style="color: #696969;">)))</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org720dba3" class="outline-2">
<h2 id="org720dba3">&lt;binary-tree&gt;</h2>
<div class="outline-text-2" id="text-org720dba3">
</div><div id="outline-container-org36a2069" class="outline-3">
<h3 id="org36a2069">&lt;binary-tree&gt;</h3>
<div class="outline-text-3" id="text-org36a2069">
<ul class="org-ul">
<li><p>&lt;binary-tree&gt; := () | (&lt;int&gt; &lt;binary-tree&gt; &lt;binary-tree&gt;)</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+simple-type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-tree&gt;</span>
  null
  node <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.value</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.left</span> <span style="color: #ae81ff;">.right</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-tree&gt;</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-tree&gt;</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">)</span>
  null <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-tree&gt;</span><span style="color: #696969;">)</span>
  node <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.value</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span><span style="color: #696969;">)</span>
           <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.left</span> <span style="color: #ae81ff;">.right</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-tree&gt;</span><span style="color: #696969;">)</span>
        <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-tree&gt;</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org43fcb5" class="outline-2">
<h2 id="org43fcb5">&lt;binary-search-tree&gt;</h2>
<div class="outline-text-2" id="text-org43fcb5">
</div><div id="outline-container-org21f1a3e" class="outline-3">
<h3 id="org21f1a3e">&lt;binary-search-tree&gt;</h3>
<div class="outline-text-3" id="text-org21f1a3e">
<ul class="org-ul">
<li><p>&lt;binary-search-tree&gt; := () | (&lt;int&gt; &lt;binary-search-tree&gt; &lt;binary-search-tree&gt;)</p></li>

<li><p>not all semantic are expressed in the above grammar.</p><p><ol class="org-ol"></p><p><li>key in the left subtree &lt;= key in the current node</li></p><p><li>keys in the right subtree &gt; key in the current node</li></ol></p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+simple-type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;order&gt;</span>
  lt eq gt<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+simple-type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-search-tree&gt;</span>
  null
  node <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.key</span> <span style="color: #66d9ef; font-weight: bold;">&lt;symbol&gt;</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.value</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span><span style="color: #696969;">)</span>
       <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.left</span> <span style="color: #ae81ff;">.right</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-search-tree&gt;</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
