docs/design-notes/type-system.org
*** search

    #+begin_src jojo
    (+fun search (-> (: :tree <binary-search-tree>)
                     (: :key <symbol>)
                  -- <binary-search-tree>)
      (match :tree
        null null
        node (match [:key :tree.key compare]
               lt [:tree.left :key recur]
               eq [:tree]
               gt [:tree.right :key recur])))
    #+end_src

*** insert

    #+begin_src jojo
    (+fun insert (-> (: :tree <binary-search-tree>)
                     (: :key <symbol>)
                     (: :vlaue <int>)
                  -- <binary-search-tree>)
      (match :tree
        null [:key :value null null node]
        node (match [:key :tree.key compare]
               lt [:tree.key :tree.value
                   :tree.left :key :value recur :tree.right node]
               eq [:key :value
                   :tree.left :tree.right node]
               gt [:tree.key :tree.value
                   :tree.left :tree.right :key :value recur node])))
    #+end_src

*** delete

    #+begin_src jojo
    (+fun delete (-> (: :tree <binary-search-tree>)
                     (: :key <symbol>)
                  -- <binary-search-tree>)
      (match :tree
        null null
        node (match [:key :tree.key compare]
               lt [:tree.key :tree.value
                   :tree.left :key recur :tree.right node]
               eq [:tree delete-node]
               gt [:tree.key :tree.value
                   :tree.left :tree.right :key recur node])))


    (+fun delete-node (-> (: :tree <binary-search-tree>)
                       -- <binary-search-tree>)
      (cond [:tree.left null?] [:tree.right]
            [:tree.right null?] [:tree.left]
            else [:tree.right left-most-key-and-value :value! :key!
                  :key :value
                  :tree.left
                  :tree.right :key delete
                  node]))

    (+fun left-most-key-and-value (-> (: :tree <binary-search-tree>)
                                   -- <symbol> <int>)
      (cond [:tree.left null?] [:tree.key :tree.value]
            else [:tree.left recur]))
    #+end_src

* >< <red-black-tree>

