docs/design-notes/type-system.html

<div id="outline-container-orgf92fdaa" class="outline-3">
<h3 id="orgf92fdaa">search</h3>
<div class="outline-text-3" id="text-orgf92fdaa">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> search <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:tree</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-search-tree&gt;</span><span style="color: #696969;">)</span>
                 <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:key</span> <span style="color: #66d9ef; font-weight: bold;">&lt;symbol&gt;</span><span style="color: #696969;">)</span>
              <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-search-tree&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:tree</span>
    null null
    node <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.key</span> compare<span style="color: #797979;">]</span>
           lt <span style="color: #797979;">[</span><span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.left</span> <span style="color: #a6e22e;">:key</span> <span style="color: #66d9ef; font-weight: bold;">recur</span><span style="color: #797979;">]</span>
           eq <span style="color: #797979;">[</span><span style="color: #a6e22e;">:tree</span><span style="color: #797979;">]</span>
           gt <span style="color: #797979;">[</span><span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.right</span> <span style="color: #a6e22e;">:key</span> <span style="color: #66d9ef; font-weight: bold;">recur</span><span style="color: #797979;">]</span><span style="color: #696969;">)))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4451965" class="outline-3">
<h3 id="org4451965">insert</h3>
<div class="outline-text-3" id="text-org4451965">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> insert <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:tree</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-search-tree&gt;</span><span style="color: #696969;">)</span>
                 <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:key</span> <span style="color: #66d9ef; font-weight: bold;">&lt;symbol&gt;</span><span style="color: #696969;">)</span>
                 <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:vlaue</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span><span style="color: #696969;">)</span>
              <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-search-tree&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:tree</span>
    null <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> <span style="color: #a6e22e;">:value</span> null null node<span style="color: #797979;">]</span>
    node <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.key</span> compare<span style="color: #797979;">]</span>
           lt <span style="color: #797979;">[</span><span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.key</span> <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.value</span>
               <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.left</span> <span style="color: #a6e22e;">:key</span> <span style="color: #a6e22e;">:value</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.right</span> node<span style="color: #797979;">]</span>
           eq <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> <span style="color: #a6e22e;">:value</span>
               <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.left</span> <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.right</span> node<span style="color: #797979;">]</span>
           gt <span style="color: #797979;">[</span><span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.key</span> <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.value</span>
               <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.left</span> <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.right</span> <span style="color: #a6e22e;">:key</span> <span style="color: #a6e22e;">:value</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> node<span style="color: #797979;">]</span><span style="color: #696969;">)))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org52fb483" class="outline-3">
<h3 id="org52fb483">delete</h3>
<div class="outline-text-3" id="text-org52fb483">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> delete <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:tree</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-search-tree&gt;</span><span style="color: #696969;">)</span>
                 <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:key</span> <span style="color: #66d9ef; font-weight: bold;">&lt;symbol&gt;</span><span style="color: #696969;">)</span>
              <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-search-tree&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:tree</span>
    null null
    node <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.key</span> compare<span style="color: #797979;">]</span>
           lt <span style="color: #797979;">[</span><span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.key</span> <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.value</span>
               <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.left</span> <span style="color: #a6e22e;">:key</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.right</span> node<span style="color: #797979;">]</span>
           eq <span style="color: #797979;">[</span><span style="color: #a6e22e;">:tree</span> delete-node<span style="color: #797979;">]</span>
           gt <span style="color: #797979;">[</span><span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.key</span> <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.value</span>
               <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.left</span> <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.right</span> <span style="color: #a6e22e;">:key</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> node<span style="color: #797979;">]</span><span style="color: #696969;">)))</span>


<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> delete-node <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:tree</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-search-tree&gt;</span><span style="color: #696969;">)</span>
                   <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-search-tree&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.left</span> null?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.right</span><span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.right</span> null?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.left</span><span style="color: #797979;">]</span>
        <span style="color: #66d9ef; font-weight: bold;">else</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.right</span> left-most-key-and-value <span style="color: #fd971f;">:value!</span> <span style="color: #fd971f;">:key!</span>
              <span style="color: #a6e22e;">:key</span> <span style="color: #a6e22e;">:value</span>
              <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.left</span>
              <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.right</span> <span style="color: #a6e22e;">:key</span> delete
              node<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> left-most-key-and-value <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:tree</span> <span style="color: #66d9ef; font-weight: bold;">&lt;binary-search-tree&gt;</span><span style="color: #696969;">)</span>
                               <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;symbol&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.left</span> null?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.key</span> <span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.value</span><span style="color: #797979;">]</span>
        <span style="color: #66d9ef; font-weight: bold;">else</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:tree</span><span style="color: #ae81ff;">.left</span> <span style="color: #66d9ef; font-weight: bold;">recur</span><span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
</div>
