docs/design-notes/type-system.org
*** [note]

    - in addition to the requirements imposed on a binary search tree
      the following must be satisfied by a red–black tree :
      1. each node is either red or black.
      2. the root is black. [this rule is sometimes omitted.]
      3. all leaves are black.
      4. if a node is red, then both its children are black.
      5. every path from a given node to any of its descendant nil nodes
         contains the same number of black nodes.

         - the number of black nodes from the root to a node
           is the node's black depth

         - the uniform number of black nodes in all paths
           from root to the leaves
           is called the black-height of the red–black tree.

    - property of red–black trees :
      the path from the root to the farthest leaf
      is no more than twice as long as the path
      from the root to the nearest leaf.
      thus, the tree is roughly height-balanced.

*** <red-black-tree> -- extrinsic

    #+begin_src jojo
    (+simple-type <color>
      red
      black)

    (+simple-type <red-black-tree>
      null
      node (: .color <color>)
           (: .key <symbol>)
           (: .value <int>)
           (: .left .right <red-black-tree>))
    #+end_src

*** <red-black-tree> -- intrinsic

    #+begin_src jojo

    #+end_src

* type-class as subtype of <<type>>

*** <<functor>>

    #+begin_src jojo
    (+subtype <<functor>> (-> <<type>> -- <<type>>)
      map (-> (: :x1 :<t1> <functor>)
              (: :f (-> :<t1> -- :<t2>))
           -- :<t2> <functor>))

    (+member <list> <<functor>>
      (+imp map (-> (: :x1 :<t1> <list>)
                    (: :f (-> :<t1> -- :<t2>))
                 -- :<t2> <list>)
        (match :x1
          null null
          cons [:x1.cdr :f recur, :x1.car :f apply, cons])))
    #+end_src

*** <<monad>>

    #+begin_src jojo
    (+subtype <<monad>> (-> <<type>> -- <<type>>)
      return (-> (: :val :<t>) -- :<t> <monad>)
      bind (-> (: :value :<t1> <monad>)
               (: :f (-> :<t1> -- :<t2> <monad>))
            -- :<t2> <monad>))
    #+end_src

