docs/design-notes/type-system.html

<div id="outline-container-org2fed7be" class="outline-2">
<h2 id="org2fed7be"><span class="todo _gt__lt_">&gt;&lt;</span> &lt;red-black-tree&gt;</h2>
<div class="outline-text-2" id="text-org2fed7be">
</div><div id="outline-container-org722aa0e" class="outline-3">
<h3 id="org722aa0e"><span class="todo _note_">[note]</span> </h3>
<div class="outline-text-3" id="text-org722aa0e">
<ul class="org-ul">
<li><p>in addition to the requirements imposed on a binary search tree</p><p>the following must be satisfied by a redblack tree :</p><p><ol class="org-ol"></p><p><li>each node is either red or black.</li></p><p><li>the root is black. [this rule is sometimes omitted.]</li></p><p><li>all leaves are black.</li></p><p><li>if a node is red, then both its children are black.</li></p><p><li>every path from a given node to any of its descendant nil nodes</p><p>contains the same number of black nodes.</p><p></p><p><ul class="org-ul"></p><p><li><p>the number of black nodes from the root to a node</p><p>is the node's black depth</p></li></p><p></p><p><li><p>the uniform number of black nodes in all paths</p><p>from root to the leaves</p><p>is called the black-height of the redblack tree.</p></li></ul></li></ol></p></li>

<li><p>property of redblack trees :</p><p>the path from the root to the farthest leaf</p><p>is no more than twice as long as the path</p><p>from the root to the nearest leaf.</p><p>thus, the tree is roughly height-balanced.</p></li></ul>
</div>
</div>

<div id="outline-container-org6832a36" class="outline-3">
<h3 id="org6832a36">&lt;red-black-tree&gt; &#x2013; extrinsic</h3>
<div class="outline-text-3" id="text-org6832a36">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+simple-type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;color&gt;</span>
  red
  black<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+simple-type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;red-black-tree&gt;</span>
  null
  node <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.color</span> <span style="color: #66d9ef; font-weight: bold;">&lt;color&gt;</span><span style="color: #696969;">)</span>
       <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.key</span> <span style="color: #66d9ef; font-weight: bold;">&lt;symbol&gt;</span><span style="color: #696969;">)</span>
       <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.value</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span><span style="color: #696969;">)</span>
       <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.left</span> <span style="color: #ae81ff;">.right</span> <span style="color: #66d9ef; font-weight: bold;">&lt;red-black-tree&gt;</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org999306a" class="outline-3">
<h3 id="org999306a">&lt;red-black-tree&gt; &#x2013; intrinsic</h3>
<div class="outline-text-3" id="text-org999306a">
<div class="org-src-container">

<pre class="src src-jojo"></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgff307da" class="outline-2">
<h2 id="orgff307da">type-class as subtype of <a id="orgea36df9"></a></h2>
<div class="outline-text-2" id="text-orgff307da">
</div><div id="outline-container-org4b45594" class="outline-3">
<h3 id="org4b45594"><a id="orgf22d237"></a></h3>
<div class="outline-text-3" id="text-org4b45594">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+subtype</span>  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span>  <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">)</span>
  map <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:x1</span> <span style="color: #a6e22e;">:&lt;t1&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;functor&gt;</span><span style="color: #696969;">)</span>
          <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:f</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:&lt;t1&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t2&gt;</span><span style="color: #696969;">))</span>
       <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t2&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;functor&gt;</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+member</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span> 
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+imp</span> map <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:x1</span> <span style="color: #a6e22e;">:&lt;t1&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">)</span>
                <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:f</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:&lt;t1&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t2&gt;</span><span style="color: #696969;">))</span>
             <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t2&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;list&gt;</span><span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:x1</span>
      null null
      cons <span style="color: #797979;">[</span><span style="color: #a6e22e;">:x1</span><span style="color: #ae81ff;">.cdr</span> <span style="color: #a6e22e;">:f</span> <span style="color: #66d9ef; font-weight: bold;">recur</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:x1</span><span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:f</span> apply<span style="color: #f92672; font-weight: bold;">,</span> cons<span style="color: #797979;">]</span><span style="color: #696969;">)))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1475610" class="outline-3">
<h3 id="org1475610"><a id="orga3bd8e3"></a></h3>
<div class="outline-text-3" id="text-org1475610">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+subtype</span>  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span>  <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">)</span>
  return <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:val</span> <span style="color: #a6e22e;">:&lt;t&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;monad&gt;</span><span style="color: #696969;">)</span>
  bind <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:value</span> <span style="color: #a6e22e;">:&lt;t1&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;monad&gt;</span><span style="color: #696969;">)</span>
           <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:f</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:&lt;t1&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t2&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;monad&gt;</span><span style="color: #696969;">))</span>
        <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t2&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;monad&gt;</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
