docs/design-notes/type-system.org
*** <maybe>

    #+begin_src jojo
    (+type <maybe> (-> (: .<t> <<type>>) -- <<type>>)
      nothing (-> -- :<t> <maybe>)
      just (-> (: .value :<t>) -- :<t> <maybe>))

    (+member <maybe> <<monad>>
      (+imp return (-> (: :v :<t>) -- :<t> <maybe>)
        :v just)
      (+imp bind (-> (: :m :<t1> <maybe>)
                     (: :f (-> :<t1> -- :<t2> <maybe>))
                  -- :<t2> <maybe>)
        (match :m
          nothing nothing
          just [:m.value :f apply])))
    #+end_src

*** <state>

    #+begin_src jojo
    (+var <state> (-> :<s> :<v> -- <<type>>)
      (-> :<s> -- :<s> :<v>))

    (+member {:<s> <state>} <<monad>>
      (+imp return (-> (: :v :<v>) -- :<s> :<v> <state>)
        {:v})
      (+imp bind (-> (: :m :<s> :<v1> <state>)
                     (: :f (-> :<v1> -- :<s> :<v2> <state>))
                  -- :<s> :<v2> <state>)
        {:m apply :f apply apply}))
    #+end_src

* quotype -- quotient type

*** [note]

    - basic 'equal?'

    - to use quotype is to to re-implement 'equal?'.

      or, generally,
      to re-implement interface functions
      of type and type-class

*** <int>

    #+begin_src jojo
    (+simple-quotype <int>
      (: .left .right <nat>))
    #+end_src

*** equal?

    #+begin_src jojo
    (+fun equal? (-> (: :x :y <int>) -- <bool>)
      :x.left :x.right sub
      :y.left :y.right sub
      equal?)
    #+end_src

*** <fraction>

    #+begin_src jojo
    (+simple-quotype <fraction>
      (: .up .down <int>))
    #+end_src

*** equal?

    #+begin_src jojo
    (+fun equal? (-> (: :x :y <fraction>) -- <bool>)
      :x.up :y.down mul
      :y.up :x.down mul
      equal?)
    #+end_src
