docs/design-notes/type-system.html

<div id="outline-container-orgb1b99d2" class="outline-3">
<h3 id="orgb1b99d2">&lt;maybe&gt;</h3>
<div class="outline-text-3" id="text-orgb1b99d2">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+type</span> <span style="color: #66d9ef; font-weight: bold;">&lt;maybe&gt;</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.&lt;t&gt;</span> <span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">)</span>
  nothing <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;maybe&gt;</span><span style="color: #696969;">)</span>
  just <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.value</span> <span style="color: #a6e22e;">:&lt;t&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;maybe&gt;</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+member</span> <span style="color: #66d9ef; font-weight: bold;">&lt;maybe&gt;</span> 
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+imp</span> return <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:v</span> <span style="color: #a6e22e;">:&lt;t&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;maybe&gt;</span><span style="color: #696969;">)</span>
    <span style="color: #a6e22e;">:v</span> just<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+imp</span> bind <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:&lt;t1&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;maybe&gt;</span><span style="color: #696969;">)</span>
                 <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:f</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:&lt;t1&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t2&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;maybe&gt;</span><span style="color: #696969;">))</span>
              <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;t2&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;maybe&gt;</span><span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">match</span> <span style="color: #a6e22e;">:m</span>
      nothing nothing
      just <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span><span style="color: #ae81ff;">.value</span> <span style="color: #a6e22e;">:f</span> apply<span style="color: #797979;">]</span><span style="color: #696969;">)))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge68e0c0" class="outline-3">
<h3 id="orge68e0c0">&lt;state&gt;</h3>
<div class="outline-text-3" id="text-orge68e0c0">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+var</span> <span style="color: #66d9ef; font-weight: bold;">&lt;state&gt;</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:&lt;s&gt;</span> <span style="color: #a6e22e;">:&lt;v&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:&lt;s&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;s&gt;</span> :&lt;v&gt;<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+member</span> <span style="color: #B380A8;">{</span><span style="color: #a6e22e;">:&lt;s&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;state&gt;</span><span style="color: #B380A8;">}</span> 
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+imp</span> return <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:v</span> <span style="color: #a6e22e;">:&lt;v&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;s&gt;</span> <span style="color: #a6e22e;">:&lt;v&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;state&gt;</span><span style="color: #696969;">)</span>
    <span style="color: #B380A8;">{</span><span style="color: #a6e22e;">:v</span><span style="color: #B380A8;">}</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+imp</span> bind <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:&lt;s&gt;</span> <span style="color: #a6e22e;">:&lt;v1&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;state&gt;</span><span style="color: #696969;">)</span>
                 <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:f</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:&lt;v1&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;s&gt;</span> <span style="color: #a6e22e;">:&lt;v2&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;state&gt;</span><span style="color: #696969;">))</span>
              <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:&lt;s&gt;</span> <span style="color: #a6e22e;">:&lt;v2&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;state&gt;</span><span style="color: #696969;">)</span>
    <span style="color: #B380A8;">{</span><span style="color: #a6e22e;">:m</span> apply <span style="color: #a6e22e;">:f</span> apply apply<span style="color: #B380A8;">}</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org11243ec" class="outline-2">
<h2 id="org11243ec">quotype &#x2013; quotient type</h2>
<div class="outline-text-2" id="text-org11243ec">
</div><div id="outline-container-org3b0822b" class="outline-3">
<h3 id="org3b0822b"><span class="todo _note_">[note]</span> </h3>
<div class="outline-text-3" id="text-org3b0822b">
<ul class="org-ul">
<li><p>basic 'equal?'</p></li>

<li><p><p></p><p>to use quotype is to to re-implement 'equal?'.</p><p></p></p><p></p><p><p></p><p>or, generally,</p><p>to re-implement interface functions</p><p>of type and type-class</p><p></p></p></li></ul>
</div>
</div>

<div id="outline-container-org4bde230" class="outline-3">
<h3 id="org4bde230">&lt;int&gt;</h3>
<div class="outline-text-3" id="text-org4bde230">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+simple-quotype</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.left</span> <span style="color: #ae81ff;">.right</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org214446a" class="outline-3">
<h3 id="org214446a">equal?</h3>
<div class="outline-text-3" id="text-org214446a">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> equal? <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:x</span> <span style="color: #a6e22e;">:y</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;bool&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:x</span><span style="color: #ae81ff;">.left</span> <span style="color: #a6e22e;">:x</span><span style="color: #ae81ff;">.right</span> sub
  <span style="color: #a6e22e;">:y</span><span style="color: #ae81ff;">.left</span> <span style="color: #a6e22e;">:y</span><span style="color: #ae81ff;">.right</span> sub
  equal?<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeadc8df" class="outline-3">
<h3 id="orgeadc8df">&lt;fraction&gt;</h3>
<div class="outline-text-3" id="text-orgeadc8df">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+simple-quotype</span> <span style="color: #66d9ef; font-weight: bold;">&lt;fraction&gt;</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">.</span> <span style="color: #ae81ff;">.up</span> <span style="color: #ae81ff;">.down</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgceab14c" class="outline-3">
<h3 id="orgceab14c">equal?</h3>
<div class="outline-text-3" id="text-orgceab14c">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+fun</span> equal? <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #a6e22e;">:x</span> <span style="color: #a6e22e;">:y</span> <span style="color: #66d9ef; font-weight: bold;">&lt;fraction&gt;</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;bool&gt;</span><span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:x</span><span style="color: #ae81ff;">.up</span> <span style="color: #a6e22e;">:y</span><span style="color: #ae81ff;">.down</span> mul
  <span style="color: #a6e22e;">:y</span><span style="color: #ae81ff;">.up</span> <span style="color: #a6e22e;">:x</span><span style="color: #ae81ff;">.down</span> mul
  equal?<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: xieyuheng</p>
<p class="date">Created: 2017-10-12 Thu 18:33</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
